app/controllers/users_controller.rb

  def create
    # @user = User.new(username: params[:username], email: params[:email], password: params[:password])
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "form test"], ["email", "kanto@gmail.com"], ["password", "forlss"], ["created_at", "2020-06-05 17:20:37.559066"], ["updated_at", "2020-06-05 17:20:37.559066"]]

  def update
    @user = User.find(params[:id])
    # @user.update(username: params[:username], email: params[:email], password: params[:password])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "test josiaézda"], ["email", "rrindrajosia@gmail.com"], ["password", "ahrkrkqs"], ["updated_at", "2020-06-05 19:15:24.320388"], ["id", 1]]